import React from 'react';
import { Link } from 'react-router-dom';
import Footer from '../../Footer/Footer/Footer';
import Navbar from '../../Home/Navbar/Navbar';


const MembersCollection = () => {

    
    return (
        <div>
            <Navbar/>
            <h1 className="text-center mt-5" >সংবিধান</h1>
            <br/>
            <div className="container mb-5">
                <h3>ভূমিকা</h3>
                <h4>যে কোন প্রতিষ্ঠানের সংবিধানই একটি মৌলিক দলিল হিসেবে বিবেচিত হয়। সংগঠন পরিচালনা, শৃঙ্খলা ও নীতিমালা সংরক্ষণে এর প্রয়োজনীয়তা অনস্বীকার্য। ইয়ং স্টার  ফাউন্ডেশনের সংবিধান এক পবিত্র আমানত । আল্লাহ তায়ালা আমাদের সংবিধানের আলোকে ফাউন্ডেশনের যাবতীয় কাজ আঞ্জাম দেয়ার তৌফিক দিন। আমীন !</h4>
                <br/>
                <h3>নাম </h3>
                <h4> <b>ধারা-১ :</b> এই সংগঠনের নাম ইয়ং স্টার ফাউন্ডেশন।</h4>
                <br/>
                <h3>লক্ষ্য ও উদ্দেশ্য</h3>
                <h4> <b>ধারা-২ :</b>  তরুণ যুবকদের সৎ, দক্ষ ও আদর্শ নাগরিক হিসেবে  গড়ে তোলা এবং  ক্ষুধা ও দারিদ্র্য  মুক্ত  সমাজ  বিনিমার্ণ।</h4>
                <br/>
                <h3>কর্মসূচি</h3>
                <h4 className="text-justify"> <b>ধারা-৩ :</b> যে সকল তরুণ/ যুবক  দুর্নীতি মুক্ত  সমাজ গড়ে তোলার জন্য  আকাঙ্খা প্রকাশ করবে তাদের  এই ফাউন্ডেশনের অধীনে সংঘবদ্ধ  করা।</h4>
                <br/>
                <h3>পরিচালনা পদ্ধতি</h3>
                <h4> <b>ধারা-৪ :</b> এই ফাউন্ডেশন সভাপতি ও সেক্রেটারিয়েটের সমন্বয়ে একটি কার্যকরি পরিষদ  গঠিত হবে।</h4>
                <br/>
                <h3>গঠন  প্রক্রিয়া</h3>
                <h4><b>ধারা-৫ : </b>এই ফাউন্ডেশনের সক্রিয় সদস্যদের প্রত্যক্ষ ভোটে ৭ জন বিশিষ্ট  একটি  কার্যকরি পরিষদ গঠিত হবে এবং  কার্যকরি পরিষদের প্রত্যক্ষ ভোটে সভাপতি ও সেক্রেটারি নির্বাচিত হবে।</h4>
                <br/>
                <h3>কার্যকাল</h3>
                <h4><b>ধারা-৬ :</b> এই ফাউন্ডেশনের কার্যকরী পরিষদ ৬ মাসের জন্য নির্বাচিত হবে।</h4>
                <br/>
                
                <h4><b>ধারা-৭ :</b>  এই ফাউন্ডেশনের কার্যকরী পরিষদের সদস্য  নির্বাচন করার কালে ব্যক্তির,
                    <br/>
                    ক: সততা <br/> 
                    খ: আমানতদারিতা  <br/>
                    গ: পদের প্রতি লোভ হীনতা <br/>
                    ঘ: সাংগঠনিক প্রজ্ঞা <br/>
                    ঙ: চরিত্রবান <br/>
                    চ: ন্যায়-পরায়ণ <br/>
                    ছ: শৃঙ্খলা  বিধানের যোগ্যতা এবং  <br/>
                    জ: কর্মের দৃরতার দিকে  <br/>
                    অবশ্যই লক্ষ্য  রাখতে হবে। <br/>
                </h4>
                <br/>
                <h3>সদস্য</h3>
                <h4><b>ধারা-৮ : </b> <br/>
                    ক: যিনি ২ নং ধারা  এর সাথে একমত পোষণ করবে<br/>
                    খ: এই ফাউন্ডেশনের সমগ্রিক কার্য-কালাপে সক্রিয়ভাবে অংশ গ্রহণ করবে<br/>
                    গ: এই ফাউন্ডেশনের বিধি-বিধান মেনে চলবে<br/>
                    তিনি এই  ফাউন্ডেশনের সদস্য হিসেবে গণ্য হবে।
                </h4>
                <br/>
                <h3></h3>
                <h4><b>ধারা-৯ : </b> কোনো সদস্য যদি ৮ নং ধারা আংশিক  বা পরিপূর্ণ ভাবে লঙ্ঘন করে,  তাহলে কার্যকরী  পরিষদ তার বিরুদ্ধে ব্যবস্থা নিবে।</h4>
                <br/>
                <h3>অর্থ</h3>
                <h4><b>ধারা-১০ : </b> এই ফাউন্ডেশন পরিচালনার জন্য  প্রতিটি সদস্যবৃন্দ নিদিষ্ট পরিমাণ অর্থ প্রদান করিবেন।</h4>
                <br/>
                <h3></h3>
                <h4><b>ধারা-১১ :</b>  এই সংবিধান পরিমার্জনের এখতিয়ার কার্যকরি পরিষদের অধীনে থাকবে।</h4>


            </div>
            <div class="text-center">
                <button className='btn btn-white btn-brand'> <Link to="/activeMember"> Active Member</Link></button>
                <button className='btn btn-white btn-brand'> <Link to="/justMember">Just Member</Link> </button>
            </div>
            <br/>
            <Footer/>
        </div>
    );
};

export default MembersCollection;